// ==UserScript==
// @name               极·虎牙直播原生最高画质
// @name:zh-CN         极·虎牙直播原生最高画质
// @name:zh-TW         極·虎牙直播原生最高畫質
// @name:zh-HK         極·虎牙直播原生最高畫質
// @description        🔥 宇宙无敌 地表最强 极致性能 0延迟 虎牙直播原生最高画质(因原生最高画质 故不存在任何卡顿) 让你纵享丝滑 🔥
// @description:zh-CN  🔥 宇宙无敌 地表最强 极致性能 0延迟 虎牙直播原生最高画质(因原生最高画质 故不存在任何卡顿) 让你纵享丝滑 🔥
// @description:zh-TW  🔥 宇宙無敵 地表最強 極致性能 0延迟 虎牙直播原生最高畫質(因原生最高畫質 故不存在任何卡頓) 讓你縱享絲滑 🔥
// @description:zh-HK  🔥 宇宙無敵 地表最強 極致性能 0延迟 虎牙直播原生最高畫質(因原生最高畫質 故不存在任何卡頓) 讓你縱享絲滑 🔥
// @namespace          https://github.com/linkwanggo
// @version            99.99.99
// @author             linkwanggo
// @grant              unsafeWindow
// @run-at             document-start
// @match              *://www.huya.com/*
// @icon               https://www.huya.com/favicon.ico
// @compatible         chrome
// @compatible         firefox
// @compatible         edge
// ==/UserScript==

;(function () {
  'use strict'
  console.log('🔥 宇宙无敌 最高最强 极致性能 虎牙直播原生最高画质 点火 🔥 10 9 8 7 6 5 4 3 2 1 --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------');Object.defineProperties(unsafeWindow,{_c:{writable:!0},hyPlayerConfig:{get:function(){return this._c},set:function(e){this._c=e,this._c.stream.iWebDefaultBitRate=99999}}});
  console.log('🔥 发射! 🔥')
})()
